Repository: stephdl/smeserver-sme9admin
Catalog: po/*/sme8admin.po
Languages: da, nl

source: Graphs on one hour, average on 5mn.
da: Grafer på en time, gennemsnit på 5 min.
nl: Grafieken over een uur, gemiddeld op 5 min.

source: Graphs on six hours, average on 5mn.
da: Grafer på seks timer, gennemsnit på 5 min.
nl: Grafieken over zes uur, gemiddeld op 5 min.

source: Graphs on one day, average on 5mn.
da: Grafer på en dag, gennemsnit på 5 min.
nl: Grafieken over een dag, gemiddeld op 5 min.

source: Graphs on three days, average on 30mn.
da: Grafer på tre dage, gennemsnit på 30 min.
nl: Grafieken over drie dagen, gemiddeld op 30 min.

source: Graphs on one week, average on 30mn.
da: Grafer på en uge, gennemsnit på 30 min.
nl: Grafieken over een week, gemiddeld op 30 min.

source: Graphs on one month, average on 2h
da: Grafer på en måned, gennemsnit på 2 timer
nl: Grafieken over een maand, gemiddeld op 2 uur.

source: Graphs on six months, average on 1d.
da: Grafer på seks måneder, gennemsnit på 1 dag.
nl: Grafieken over zes maanden, gemiddeld op 1 dag.

source: Graphs on one year, average on 1d
da: Grafer på et år, gennemsnit på 1 dag
nl: Grafieken over een jaar, gemiddeld op 1 dag.

source: Maximum number of incoming e-mails
da: Maksimum på antal indkomne e-mails
nl: Maximum aantal binnenkomende email berichten

source: Maximum number of outgoing e-mails
da: Maksimum på antal udgående e-mails
nl: Maximum aantal uitgaande email berichten

source: Maximum % of hard disk usage
da: Maksimum % af hardisk anvendelse
nl: Maximum % van harde schijf gebruik

source: Maximum % of cpu usage
da: Maksimum % af cpu anvendelse
nl: Maximum % van cpu gebruik

source: Maximum temperature for cpu and motherboard
da: Maksimum temperatur for cpu og bundkort
nl: Maximum temperatuur van cpu en moederbord

source: Maximum hard disk temperature
da: Maksimal hardisk temperatur
nl: Maximum temperatuur van de harde schijf

source: Maximum number of samba sessions
da: Maksimum antal samba sessioner
nl: Maximum aantal samba sessies

source: Maximum number of ssh sessions
da: Maksimum antal ssh sessioner
nl: Maximum aantal ssh sessies

source: Maximum number of ftp sessions
da: Maksimum antal ftp sessioner
nl: Maximum aantal ftp sessies

source: Maximum number of vpn sessions
da: Maksimum antal vpn sessioner
nl: Maximum aantal vpn sessies

source: View graphs on :
da: Vis graf for:
nl: Bekijk grafieken voor :

source: server's hardware (sensors)
da: Serverens hardware (sensorer)
nl: server hardware (sensoren)

source: network use (connections,sessions,load)
da: netværksdata (forbindelser, sessioner, belastning)
nl: netwerk gebruik (verbindingen, sessies, belasting)

source: system performance (cpu, memory, hard disk)
da: Systemydelse (cpu, hukommelse, harddisk)
nl: systeem gebruik (cpu, geheugen, vaste schijf)

source: Advanced connection tests on services
da: Udvidet forbindelsestest til services
nl: Geavanceerde verbindings test op diensten

source: Configuration of sme8admin
da: Konfiguration af sme8admin
nl: Instellingen van sme8admin

source: Active tcp connections tcp with external(blue)/local(green) connections highlighted :
da: Aktive tcp forbindelser. Tcp med eksterne(blå) og lokale(grønne) forbindelser er fremhævet:
nl: Actieve tcp verbindingen. Tcp met externe (blauw) / lokale (groen) verbindingen zijn benadrukt :

source: Local IP:port
da: Lokal IP:port
nl: Lokaal IP:poort

source: PID/Process
da: PID/Proces
nl: PID/Proces

source: Remote IP:port
da: Fjern IP:port
nl: Afgelegen IP:poort

source: State
da: Status
nl: Staat

source: Stats :
da: Statistik:
nl: Statistieken :

source: Connected users :
da: Tilsluttede brugere:
nl: Verbonden gebruikers :

source: Command
da: Kommando
nl: Opdracht

source: From
da: Fra
nl: Van

source: Idle
da: Inaktiv
nl: Stationair

source: Login
nl: Inloggen

source: Since
da: Siden
nl: Sindsdien

source: Web services
da: Web tjenester
nl: Web diensten

source: Administrative services
da: Administrative tjenester
nl: Administratieve diensten

source: Network services
da: Netværkstjenester
nl: Netwerk diensten

source: File-sharing services
da: Fildelingstjenester
nl: Bestand-deling diensten

source: E-mail services
da: E-mail tjenster
nl: E-mail diensten

source: DNS services
da: DNS tjenester
nl: DNS diensten

source: Authentication services
da: Identifikationstjenster
nl: Authenticatie diensten

source: Misc. services
da: Diverse tjenester
nl: Overige diensten

source: System services
da: Systemtjenester
nl: Systeem diensten

source: System services (Click on a service name for details) :
da: Systemtjenester (klik på en tjeneste for detaljer):
nl: Systeem diensten (Klik op een dienst naam voor details) :

source: Action
da: Vælg
nl: Actie

source: Nb process
da: Antal processer
nl: Nb proces

source: Service
da: Tjeneste
nl: Dienst

source: Stopped
da: Stoppet
nl: Gestopt

source: Started
da: Startet
nl: Gestart

source: Listening tcp sockets, and corresponding process :
da: Tcp sockets der lytter, og tilsvarende processer:
nl: Luisterende tcp aansluitingen en overeenkomstige processen

source: Last update of ClamAV antivirus : %s.
da: Seneste opdatering af ClamAV antivirus: %s.
nl: Laatste update van ClamAV anti virus : %s.

source: Warning ! Your antivirus may not be up-to-date.
da: Advarsel: Din antivirus er måske ikke opdateret.
nl: Waarschuwing ! Uw anti virus is mogelijk niet bijgewerkt.

source: The database contains %s virus signatures.
da: Databasen indeholder %s virus signaturer.
nl: De database bevat %s virus kenmerken.

source: Some feature request, comment or bug report ? send an e-mail to
da: Ønsker, kommentarer eller fejlrapporter? Send en e-mail til
nl: Voor nieuwe functie aanvragen, commentaar of fout rapporten, zend een e-mail naar

source: Configuration of status e-mails.
da: Konfiguration af status e-mails.
nl: Configuratie van status e-mail berichten.

source: If you set the frequency to 0, status e-mails are disabled. You can put only the username if the recipient is a local user.
da: hvis du sætter frekvensen til 0, deaktiveres status e-mails. Du kan nøjes med at indsætte brugernavn hvis modtageren er en lokal bruger.
nl: Als u the frequentie op 0 zet, worden er geen status e-mails verzonden. U kunt alleen de gebruikersnaam invoeren als de ontvanger een lokale gebruiker is.

source: Status e-mails recipient
da: Modtager af status e-mails
nl: Ontvanger van status e-email berichten

source: Frequency of status e-mails (* 5min)
da: Frekvens for status e-mails (* 5 min.)
nl: Frequentie van status e-mails (* 5min)

source: Configuration of MySQL connection.
da: Konfiguration af MySQL forbindelser.
nl: Configuratie van MySQL verbinding.

source: You shall only modify these settings if you change the default values with phpMyAdmin or mysqladmin. These settings don't directly affect the configuration of MySQL.
da: Du skal kun ændre disse indstillinger hvis du ændrer standardværdierne med phpMyadmin eller mysqladmin. Disse indstillinger har ingen direkte effekt på konfigurationen af MySQL.
nl: U zult alleen deze instellingen veranderen als U de standaard instellingen verandert met phpMyAdmin of mysqladmin. Deze instellingen beïnvloeden niet direct the configuratie van MySQL.

source: MySQL user
da: MySQL bruger
nl: MySQL gebruiker

source: Password
da: Kodeord
nl: Wachtwoord

source: Configuration of network settings.
da: Konfiguration af netværksindstillinger.
nl: Configuratie van netwerk instellingen.

source: You can specify the names of the network interfaces to monitor, the e-mail domains and adresses to count in the e-mail graph (list of domains or adresses separated by semicolons. "me@domain.fr ; other-domain.com ; virtual.domain.fr" - the primary domain name and virtual domains are already counted). You can already choose a target for the ping latency graph (www.google.fr, default gateway,...)
da: Du kan angive hvilke netværksstjenster der skal overvåges, e-mail domæner og adresser som inkluderes i e-mail grafen (lister med domæner eller adresser adskilles med semikolon. "mig@domaine.dk ; andet-domaine.com ; virtuelt.domaine.dk" - Det primære domæne og virtuelle domæner er i forvejen inkluderet). Du kan også vælge et mål til brug i ping ventetid (www.google.dk, standard gateway, ...)
nl: U kunt de namen opgeven van de netwerk adapters die bewaakt moeten worden, de e-mail domeinen en adressen die geteld moeten worden in de e-mail grafiek (lijst van domeinen of adressen gescheiden met een punt-komma. "mij@domein.nl ; ander-domein.com ; virtueel.domein.nl" - Het primaire domein en virtuele domeinen worden al geteld). U kunt ook het doel kiezen voor de ping vertraging grafiek (www.google.nl, default gateway, ...)

source: Other e-mail domains
da: Andre e-mail domæner
nl: Andere e-mail domeinen

source: Ping target
da: Ping mål
nl: Ping doel

source: Web panel configuration.
da: Web panel konfiguration.
nl: Web paneel configuratie.

source: You can set the format and size of graphs, and the bounds upon which pppoe and vpn connections need to be highlighted.
da: Du kan vælge form og størrelse på grafer, og grænser for hvornår pppoe og vpn forbindelser skal fremhæves.
nl: U kunt het formaat en de grootte van de grafieken instellen en de grenswaarden waarbij pppoe en vpn verbindingen aangegeven moeten worden.

source: Graphs width
da: Grafers bredde
nl: Grafiek breedte

source: Graphs height
da: Grafers højde
nl: Grafiek hoogte

source: Pppoe disconnection lasting more than (in minutes)
da: Pppoe afbrydelser med varighed i mere end (i minutter)
nl: Verbroken Pppoe verbindingen die langer duurde (in minuten) dan

source: Pppoe connection lasting less than (in hours)
da: Pppoe forbindelser med varighed i mindre end (i timer)
nl: Pppoe verbindingen die minder lang duurde (in uren) dan

source: Vpn connection lasting more than (in hours)
da: Vpn forbindelser med varighed i mere end (i timer)
nl: Vpn verbindingen die langer duurde (in uren) dan

source: Configuration of hardware sensors.
da: Konfiguration af hardware sensorer.
nl: Configuratie van hardware sensoren.

source: For the hard disks, generally you have 'hda' or 'hdb' with IDE and 'sda' or 'sdb' with SATA/SCSI. If you have only on disk, let the second field blank. You can choose to activate the computing of the main directories' size of SME. (maybe long and resource-consuming on large disks). To find available sensors, execute 'sensors' in a shell, and look for the keywords corresponding to the working sensors ('temp1','CPU Temp','MB Temp','fan3',....). Let the fields blank if you have no sensors available.
da: For harddiskene har du nomalt en "hda" eller "hdb" med IDE og "sda eller "sdb" med SATA/SCSI. Hvis du kun har én harddisk, så lad det andet felt være tomt. Du kan vælge at aktivere beregning af de primære mappers størrelse på SME serveren. (du -s) (den kan være tidskrævende på store diske). For at finde tilgængelige sensorer, eksekver kommandoen "sensors" i en shell, og kik efter nøgleordene for de aktive sensorer ("temp1", "CPU Temp", "MB TEMP", "fan3", ...). Lad felterne være tomme hvis der ikke er tilgængelige sensorer.
nl: Voor de harde schijven, heb je in het algemeen 'hda' of 'hdb' bij IDE en 'sda' of 'sdb' met SATA/SCSI. Als er maar een schijf is, laat dan het tweede veld leeg. U kunt kiezen om de grootte van de hoofd folders van SME uit te rekenen. (bij grote schijven kan dit lang duren en vraagt capaciteit). Om beschikbare sensoren te vinden, gebruik de opdracht 'sensors' in een shell en kijk voor sleutel woorden die corresponderen met werkende sensoren ('temp1','CPU Temp','MB Temp', 'fan3',....). Laat de velden leeg als u geen sensoren beschikbaar heeft.

source: Activate du -s:
da: Aktiver du -s:
nl: Activeer du -s:

source: First hard disk
da: Første harddisk
nl: Eerste harde schijf

source: Second hard disk
da: Anden harddisk
nl: Tweede harde schijf

source: First sensor (cpu)
da: Første sensor (cpu)
nl: Eerste sensor (cpu)

source: Second sensor (motherboard)
da: Anden sensor (bundkort)
nl: Tweede sensor (moederbord)

source: Third sensor (fan)
da: Tredje sensor (fan)
nl: Derde sensor (ventilator)

source: Configuration of alerts.
da: Konfiguration af adviseringer.
nl: Waarschuwings configuratie.

source: You should notice that these values are not limits FOR the system, but just values beyond which an alert e-mail is sent. If you set the limit to 0, the alert is disabled. You can put only the username if the recipient is a local user.
da: Bemærk. Disse værdier er IKKE grænseværdier for systemet, men kun grænser som - hvis de overskrides - betyder, at der sendes en adviserings e-mail. Hvis du sætter grænsen til 0, så deaktiveres adviseringer. Du kan nøjes med at angive brugernavn på lokale brugere.
nl: Merk op dat deze waardes niet de limieten zijn voor het systeem, maar alleen waardes die bij overschrijding een e-mail waarschuwing genereren. Als u de limiet op 0 zet, staat de waarschuwing uit. U hoeft alleen de gebruikersnaam op te geven als de ontvanger een lokale gebruiker is.

source: Alert e-mails recipient
da: Modtager af adviserings e-mail
nl: Ontvanger van waarschuwing e-mails

source: Save
da: Gem
nl: Opslaan

source: Alert configuration.
da: Konfiguration af adviseringer.
nl: Waarschuwing configuratie.

source: Put 0 to desactivate it.
da: Indsæt 0 for at deaktivere.
nl: Voer 0 in om te de-activeren.

source: "%s" is not a valid e-mail address.
da: "%s" er ikke en gyldig e-mail adresse.
nl: "%s" is geen geldig e-mail adres.

source: "%s" is not an integer numeric value for the setting '%s'.
da: "%s" er ikke en heltalsværdi for opsætningen '%s'.
nl: "%s" is niet een geheel getal voor instelling '%s'.

source: Status e-mails have been disabled.
da: Adviserings e-mails er deaktiveret.
nl: Status e-mail staat uit.

source: New settings have been saved.
da: De nye indstillinger er gemt.
nl: De nieuwe instellingen zijn opgeslagen.

source: The settings are the same, nothing has been modified.
da: Indstillingen er den samme, intet er ændret.
nl: De instellingen zijn hetzelfde. Er is niets veranderd.

source: An error occured. Check the settings you provided.
da: Der opstod en fejl. Kontroller de indtastede indstilliner.
nl: Er is een fout opgetreden. Controleer de ingegeven instellingen.

source: Back
da: Tilbage
nl: Terug

source: These differents tests may produce false positives, do not take care of them.
da: Disse tests kan producere falske positive, tag dem ikke alvorligt.
nl: Deze verschillende testen kunnen valse positieven produceren, reageer hier niet op.

source: Execute them only if you know what they do, and how to analyse their results.
da: Eksekver dem kun, hvis du ved hvad du gør, og er i stand til at analysere resulterne.
nl: Voer ze alleen uit als U weet wat ze doen en hoe U de resultaten kunt analyseren.

source: Test http service
da: Test http tjenesten
nl: Test http dienst

source: Test samba service
da: Test Samba tjenesten
nl: Test samba dienst

source: Test network latency
da: Test netværks forsinkelse
nl: Test netwerk vertragingen

source: Test ftp service
da: Test ftp tjeneste
nl: Test ftp dienst

source: Test ssh service
da: Test ssh tjeneste
nl: Test ssh dienst

source: Test pop service
da: Test pop tjeneste
nl: Test pop dienst

source: Test smtp service
da: Test smtp tjeneste
nl: Test smtp dienst

source: Execution of 'http@' (should return html source code of server's homepage):
da: Eksekver "http@" (bør returnere html kildekode for serverens hjemmeside):
nl: Uitvoeren van 'http@' (zal html bron code retourneren van de server's thuis pagina):

source: Execution of 'smbcontrol smbd ping' (samba server answers giving its PID):
da: Eksekver "smbcontrol smdb ping" (samba serveren svarer med dens PID):
nl: Uitvoeren van 'smbcontrol smbd ping' (samba server antwoord met zijn PID):

source: Execution of 'ping google.fr -c 1' (latency):
da: Eksekver "ping google.fr -c 1" (forsinkelse):
nl: Uitvoeren van 'ping google.fr -c 1' (vertraging):

source: Execution of 'echo "SYST" | nc %s 21' (ftp opened to the external network):
da: Eksekver "echo "SYST" | nc %s 21" (ftp åbent til det eksterne netværk):
nl: Uitvoeren van 'echo "SYST" | nc %s 21' (ftp geopend naar het externe netwerk):

source: Execution of 'echo "hello" | nc %s 22' (ssh opened to the external network):
da: Eksekver "echo "hello" | nc %s 22" (ssh åbent til det eksterne netværk):
nl: Uitvoeren van 'echo "hello" | nc %s 22' (ssh openen naar het externe netwerk):

source: Execution of 'echo "quit" | nc %s 110' (pop server running):
da: Eksekver "echo "quit" | nc %s 110 (pop server kører):
nl: Uitvoeren van 'echo "quit" | nc %s 110' (pop server actief):

source: Execution of 'echo "quit" | nc -i 2 %s 25' (smtp server running):
da: Eksekver 'echo "quit" | nc -i 2%s 25' (smtp server kører):
nl: Uitvoeren van 'echo "quit" | nc -i 2 %s 25' (smtp server actief):

source: Another test
da: En anden test
nl: Nog een test

source: Check MySQL connection settings.
da: Kontroller MySQL forbindelsesopsætning.
nl: Controleer MySQL verbindings instellingen.

source: one hour
da: en time
nl: één uur

source: six hours
da: seks timer
nl: zes uur

source: the day
da: dag
nl: de dag

source: three days
da: tre dage
nl: drie dagen

source: one week
da: en uge
nl: één week

source: one month
da: en måned
nl: één maand

source: six months
da: seks måneder
nl: zes maanden

source: one year
da: et år
nl: één jaar

source: System load for the apache web server (httpd-e-smith & httpd-admin processes) on
da: Systembelastning for Apache web server (httpd-e-smith & httpd-admin processer) på
nl: Systeem belasting voor de apache web server (httpd-e-smith & httpd-admin processen) op

source: System load for the transparent http/ftp proxy squid on
da: Systembelastning for den transparante http/ftp squid på
nl: Systeem belasting op de transparante http/ftp proxy squid actief

source: IP Address
da: IP-adresse
nl: IP adres

source: Hostname
da: Værtsnavn
nl: Hostnaam

source: Start
nl: Begin

source: End
da: Slut
nl: Einde

source: Detailed list of the last times a host has connected to a samba share.
da: Detaljeret liste over sidste gang en vært har tilsluttet sig til et samba share.
nl: Gedetailleerde lijst van de laaste keer een host verbinding had met een samba gedeelde map.

source: System load for the samba server (smbd & nmbd processes) on
da: Systembelastning for samba server (smbd & nmbd processer) på
nl: Systeem belasting voor de samba server (smbd & nmbd processen) op

source: Written data (Ko)
da: Skrevet data (Ko)
nl: Geschreven data (Ko)

source: Read data (Ko)
da: Læst data (Ko)
nl: Gelezen data (Ko)

source: Detailed list of the last connections (on the last 7 days) to the afp service (Apple File Protocol).
da: Detaljeret liste over seneste tilslutninger (i de sidste 7 dage) til afp tjeneste (Apple File Protokol).
nl: Gedetailleerde lijst van verbindingen (over de laatste 7 dagen) met de AFP dienst (Apple File Protocol).

source: System load for the appletalk server (atalkd, papd, afpd and cnid_metad processes).
da: Systembelastning for appletalk server (atalkd, papd, afpd and cnid_metad processer).
nl: Systeem belasting voor de Appletalk diensten (atalkd, papd, afpd en cnid_metad processen).

source: Duration
da: Varighed
nl: Looptijd

source: Client IP address
da: Klient IP adresse
nl: Klient IP adres

source: Client local IP address
da: Klient lokal IP adresse
nl: Klient lokaal IP adres

source: Incoming data (Ko)
da: Indkommende data (Ko)
nl: Inkomende data (Kb)

source: Outgoing data (ko)
da: Udgående data (ko)
nl: Uitgaande data (Kb)

source: Detailed list of vpn connections (Virtual Private Network).
da: Detaljeret liste over vpn forbindelser (Virtuelt Privat Netværk).
nl: Gedetailleerde lijst van VPN verbindingen (Virtual Private Network).

source: MAC Address
da: MAC adresse
nl: MAC adres

source: Date of renewal
da: Dato på fornyelse
nl: Hernieuwing datum

source: List of the last dhcp leases renewal (Dynamic Host Control Protocol).
da: Liste over de seneste fornyelser af dhcp leases (Dynamic Host Control Protocol).
nl: Lijst met de laatste DHCP lease hernieuwingen (Dynamic Host Control Protocol).

source: Connection peer
nl: Verbindings partner

source: Detailed list of ADSL/PPPoE connections.
da: Detaljeret liste over ADSL/PPPoE forbindelser.
nl: Gedetailleerde lijst van ADSL/PPPoE verbindingen.

source: Connected ?
da: Forbundet?
nl: Verbonden?

source: No
da: Nej
nl: Nee

source: Yes
da: Ja
nl: Ja

source: Detailed list of ssh connections (Secure SHell).
da: Detaljeret lister over ssh forbindelser (Secure SHell).
nl: Gedetailleerde list van ssh verbindingen (Secure SHell).

source: Detailed list of the last connections (on the last 7 days) to the ftp service (File Transfer Protocol).
da: Detaljeret liste over over seneste forbindelser ( på de sidste 7 dage) til ftp tjeneste (File Transfer Protocol).
nl: Gedetailleerde lijst van verbindingen (over de laatste 7 dagen) met de FTP dienst (File Transfer Protocol).

source: See the records on
da: Se poster på
nl: Bekijk de attributen voor

source: MySQL error : Impossible to prepare SQL query "%s" : %s
da: MySQL fejl: Umuligt at forberede SQL forespørgsel "%s" : %s
nl: MySQL fout: Onmogelijk om de SQL query "%s" voor te bereiden : %s

source: MySQL error : Can't execute query : %s
da: MySQL fejl: kan ikke eksekvere forspørgsel: %s
nl: MySQL fout: Kan query %s niet uitvoeren

source: Connections which lasted
da: Forbindelser som varede
nl: Verbindingen die duurden

source: more than %s hours are highlighted.
da: mere end %s timer er fremhævet.
nl: meer dan %s uur zijn benadrukt.

source: less than %s hours are highlighted.
da: mindre end %s timer er fremhævet.
nl: minder dan %s uur zijn benadrukt.

source: Disconnections which lasted
da: Afbrudte forbindelser som varede
nl: Verbindingen die verbroken waren voor

source: more than %s minutes are highlighted.
da: mere end %s minutter er fremhævet.
nl: meer dan %s minuten, zijn benadrukt.

source: root connections are highlighted.
da: root forbindelser er fremhævet.
nl: root verbindingen zijn benadrukt.

source: Successful
da: Vellykket
nl: Succesvol

source: Disconnection lasted more than %s minutes
da: Afbrudt forbindelse varede mere end %s minutter
nl: Verbindingen die voor meer dan %s minuten verbroken waren

source: Error at RRDs::graph(%s) : %s
da: Fejl ved RRDs::graph(%s) : %s
nl: Fout bij RRDs::grafiek(%s) : %s

source: View graphs on
da: Vis graf for
nl: Bekijk grafieken voor

source: Temperatures
da: Temperaturer
nl: Temperaturen

source: Hardware temperatures (Processor, motherboard, hard disks).
da: Hardware temperaturer (processor, bundkort, hard disks).
nl: Hardware temperaturen (Processor, moederbord, harde schijven).

source: Processor fan speed.
da: Processorens blæserhastighed
nl: Processor ventilator snelheid.

source: Fan speed
da: Blæserhastighed
nl: Ventilator snelheid

source: Rpm
nl: opm

source: Number of opened tcp connections for ssh, ftp, vpn, afp and netbios protocols.
da: Antal åbne tcp forbindelser for ssh, ftp, vpn, afp og netbios protokoller
nl: Aantal open TCP verbindingen voor SSH, FTP, VPN, AFP en NETBIOS protocolen.

source: Opened connections
da: Åbne forbindelser
nl: Geopende verbindingen

source: Number of dhcp leases renewals and opened samba shares.
da: Antal fornyede dhcp forbindelser og åbne samba fællesdrev.
nl: Aantal DHCP lease hernieuwingen en geopende SAMBA shares.

source: Number of incoming/outgoing e-mails and amount of spam/viruses filtered.
da: Antal indgående/udgående e-mails og mængden af filtreret spam/virus.
nl: Aantal inkomende/uitgaande e-mail berichten en hoeveelheid spam/virussen die gefilterd zijn.

source: Incoming/outgoing/spam/virus e-mails
da: Indgående/udgående/spam/virus e-mails
nl: Inkomende/uitgaande/spam/virus e-mail berichten

source: Incoming mail
da: Indgående e-mail
nl: Inkomende post

source: Outgoing mail
da: Udgående e-mail
nl: Uitgaande post
