Repository: stephdl/smeserver-sme9admin
Catalog: po/*/sme8admin.po
Languages: da, nl

source: Average and maximal ping with the selected target.
da: Gennemsnits og maksimal ping på det valgte mål.
nl: Gemiddelde en maximale ping met het geselecteerde doel.

source: Target ping latency
da: Målets ping ventetid
nl: Doel ping vertraging

source: Avg ping
da: Gnms ping
nl: Gemiddelde ping

source: Pkt loss
da: Pkt tab
nl: Pakket verlies

source: Load on the local network interface.
da: Belastning på det interne netværkskort
nl: Belasting op de lokale netwerk interface

source: Local network load
da: Internt netværksbelastning
nl: Lokale netwerk belasting

source: Incoming bytes
da: Indkommende bytes
nl: Inkomende bytes

source: Outgoing bytes
da: Udgående bytes
nl: Uitgaande bytes

source: Load on the external network interface (to internet).
da: Belastning på det eksterne netværkskort (til internettet)
nl: Belasting op externe netwerk interface (naar het Internet).

source: External network load
da: Ekstern netværksbelastning
nl: Externe netwerk belasting

source: Network load on the server except routing.
da: Netværksbelastning på serveren eksklusiv routning.
nl: Netwerk belasting op de server met uitzondering van routing.

source: If the blue curve is :
da: Hvis den blå kurve er:
nl: Het teken van de blauwe curve is :

source: positive => download from the internet
da: Positiv => Download fra internettet
nl: positief => download van het Internet

source: negative => upload from the local network
da: Negativ => Opload fra lokalnettet
nl: negatief => opladen vanaf het locale netwerk

source: If the red curve is :
da: Hvis den røde kurve er:
nl: Het teken van de rode curve is :

source: positive => upload from the internet
da: Positiv => Opload fra internettet
nl: positief => opladen vanaf het Internet

source: negative => download from the local network
da: Negativ => Download fra lokalnettet
nl: negatief => downloaden vanaf het locale netwerk

source: Network load on the server
da: Netværksbelastning på serveren
nl: Netwerk belasting op de server

source: Distribution of cpu usage for system, user and niced processes.
da: Fordeling af cpu belastning på system, brugere og interne processer
nl: Verdeling van CPU gebruik voor het systeem, gebruikers en lage prioriteits processen.

source: Cpu usage
da: Cpu forbrug
nl: Cpu gebruik

source: System load average on 1mn,5mn,15mn compared to cpu usage.
da: Systembelastning, gennemsnit på 1 min, 5 min, 15 min i forhold til cpu forbrug
nl: Gemiddelde systeem belasting op 1min, 5min, 15min vergeleken met cpu gebruik.

source: System load / Cpu %
da: Systembelastning / Cpu %
nl: Systeem belasting / Cpu %

source: Number of running processes on the server, and kernel run queue size.
da: Antal kørende processer på serveren, og størrelsen på kernel run queue
nl: Aantal lopende processen op de server en kernel run queue grootte

source: Number of processes / run queue size
da: Antal processer / kerne kø-størrelse
nl: Aantal processen / grootte van de run queue

source: Processes
da: Processer
nl: Processen

source: Server uptime.
da: Serverenes oppetid.
nl: Tijd actief.

source: Uptime
da: Oppetid
nl: Actieve tijd

source: Days
da: Dage
nl: Dagen

source: Detailed usage of the server memory.
da: Detaljeret brug af serverens hukommelse.
nl: Gedetailleerd overzicht van server geheugen gebruik.

source: Memory usage
da: Hukommelsesbrug
nl: Geheugen gebruik

source: Cached
nl: Gebufferd

source: Used
da: Brugt
nl: Gebruikt

source: Free
da: Ledig
nl: Vrij

source: Total
da: I alt
nl: Totaal

source: Swap usage (virtual memory) on the server's hard disk.
da: Swap brug (virtuel hukommelse) på serverens harddisk.
nl: Tijdelijk geheugen gebruik (virtueel geheugen) op de harde schijf van de server.

source: Swap usage
da: Swap brug
nl: Tijdelijk geheugen gebruik

source: Amount of raw data read/written on the hard disk.
da: Mængden af raw data læst/skrevet på harddisken.
nl: Hoeveelheid ruwe lees/schrijf acties op de harde schijf.

source: Donnees ecrites/lues
da: Data læst/skrevet
nl: Data geschreven / gelezen

source: Blocks/s
nl: Blokken/s

source: Read
da: Læst
nl: Gelezen

source: Written
da: Skrevet
nl: Geschreven

source: Hard disk usage
da: Harddisk brug
nl: Harde schijf gebruik

source: Detailed usage of disk space (squid cache, mysql databases, log files, user files..).
da: Detaljeret brug af harddisk (squid cache, mysql databaser, log filer, bruger filer..).
nl: Gedetailleerd overzicht van gebruikte harde schijf ruimte (squid cache, mysql databases, log bestanden, gebruikers bestanden ...).

source: Disk space usage.
da: Disk plads brug.
nl: Gebruikte schijf ruimte.

source: Error at RRDs::update
da: Fejl ved RRDs::update
nl: Fout bij RRDs::aanpassen

source: Number of opened connections :
da: Antal åbne forbindelser:
nl: Aantal geopende verbindingen :

source: During the last 5 minutes, %s incoming e-mails were detected,
da: I de seneste 5 minutter, blev der registreret %s indkommende e-mails,
nl: Gedurende de laatste 5 minuten, waren er %s inkomende e-mail berichten gedetecteerd,

source: you had set the alert limit to %s incoming e-mails.
da: du har sat advarselsgrænsen til %s indkommende e-mails.
nl: U had de alarm limiet ingesteld op %s inkomende e-mail berichten.

source: (Possible reasons : do you receive spam ? a mailbomb ? mailing-lists ?)
da: (Mulig årsag: Modtager du spam? en mailbomber? mailing-lister?)
nl: (Mogelijke redenen : ontving je spam ? een mail bom ? mailing-llijsten ?)

source: If you have access to the server-manager, use this link to modify the limit :
da: Hvis du har adgang til server-manager, så brug dette link til at redigere grænsen:
nl: Als u toegang heeft tot de server-manager, gebruik deze link om de limiet te wijzigen :

source: During the last 5 minutes, %s outgoing e-mails were detected,
da: I de sidste 5 minutter, er der registreret %s udgående e-mails,
nl: Gedurende de laatste 5 minuten, waren er %s uitgaande e-mail berichten gedetecteerd,

source: you had set the alert limit to %s outgoing e-mails.
da: Du har sat advarselsgrænsen til %s udgående e-mails.
nl: U had de alarm limiet ingesteld op %s uitgaande e-mail berichten.

source: (Possible reasons : do you send spam ? administrate a mailing-list ?)
da: (Mulig årsag: Sender du spam? Administrerer en mailing-liste?)
nl: (Mogelijke redenen : verzend je spam ? administreer je een mailing-lijst ?)

source: Your hard disk is %s %% full,
da: Din harddisk er %s %% fuld,
nl: Uw harde schijf is %s %% vol,

source: you had set the alert limit to %s %%.
da: du har sat advarselsgrænsen til %s %%.
nl: U had de alarm limiet ingesteld op %s %%.

source: (Advice : free space by deleting temp files, or upgrade your disk space)
da: (Et godt råd: Frigiv plads ved at slette temp filer, eller opgrader din diskstørrelse)
nl: (Advies : maak ruimte door het verwijderen van tijdelijke bestanden of door het installeren van een grotere disk)

source: Your processor is %s %% loaded,
da: Din processor er %s %% belastet,
nl: Uw processor is %s %% belast,

source: (Possible reasons : Is there a crashed process ? an intense and prolonged activity on the server ?)
da: (Mulig årsag: Kører en ødelagt proces? En intensiv og længerevarende aktivitet på serveren?)
nl: (Mogelijke redenen : is er een gecrasht proces ? een intense en langdurige activiteit op de server ?)

source: The temperature reported by sensor %s is %s degrees C,
da: Sensor %s har registreret temperaturen %s grader celsius,
nl: De temperatuur gerapporteerd door sensor %s is %s graden C,

source: you had set the alert limit to %s degrees C.
da: du har sat advarselsgrænsen til &s grader celsius.
nl: U had de alarm limiet ingesteld op %s graden C.

source: (Advice : check the fans, and if the room is well ventilated or under AC.)
da: (Et godt råd: Kontroller ventilatorerne, og om rummet har aircondition(AC))
nl: (Advies: controleer de ventilatoren, en of the kamer voldoende geventileerd is of of de kamer airconditioned is.)

source: The temperature of %s hard disk is %s degrees C,
da: Harddisken &s temperatur er &s grader celsius,
nl: De temperatuur van harde schijf %s is %s graden C,

source: (Advice : check if the server case and the hard disks are well cooled.)
da: (Et godt råd: Kontroller om serverkabinet og harddiskene velafkøles effektivt.)
nl: (Advies: controleer of de server behuizing en de harde schijven voldoende gekoeld zijn.)

source: There are %s opened connections to the SAMBA service,
da: Der er &s åbne forbindelser til SAMBA tjenesten,
nl: Er zijn %s geopende verbindingen met de SAMBA dienst,

source: you had set the alert limit to %s connections.
da: Du har sat advarselsgrænsen til %s forbindelser.
nl: U had de alarm limiet ingesteld op %s verbindingen.

source: (Advice : if you encounter problems accessing local neighboorhood, kill some connections.)
da: (Et godt råd: Hvis du oplever problemer med at få adgang til lokale netværk, så luk nogle forbindelser ned.)
nl: (Advies: al je problemen hebt met toegang tot de locale omgeving, stop dan een aantal verbindingen.)

source: There are %s opened SSH sessions on the server,
da: Der er %s åbne SSH forbindelser på serveren,
nl: Er zijn %s geopende SSH sessies op de server,

source: you had set the alert limit to %s sessions.
da: Du har sat advarselsgrænsen til &s forbindelser.
nl: U had de alarm limiet ingesteld op %s sessies.

source: (Advice : check if it is known administrative connections, and not hackers.)
da: (Et godt råd: Kontroller at det er kendte administrative forbindelser, og ikke hackere.)
nl: (Advies: controleer of het een bekende administratieve verbinding is en niet een hacker.)

source: There are %s opened FTP sessions on the server,
da: Der er %s åbne FTP forbindelser på serveren,
nl: Er zijn %s geopende FTP sessies op de server,

source: (Advice : check that it is authorized users only.)
da: (Et godt råd: Kontroller, at der kun er autoriserede brugere.)
nl: (Advies: controller dat het alleen geautoriseerde gebruikers zijn.)

source: There are %s opened VPN sessions on the server,
da: Der er %s åbne VPN forbindelser på serveren,
nl: Er zijn %s geopende VPN sessies op deze server,

source: Dhcp & Smbstatus
da: Status for dhcp & smb

source: Max ping
da: Maks ping

source: Buffers
da: Buffer
