Repository: stephdl/smeserver-sme9admin
Catalog: po/*/sme9admin.po
Languages: sv

source: Graphs on one hour, average on 5mn.
sv: Graf över en timme, medel över 5 min.

source: Graphs on six hours, average on 5mn.
sv: Graf över sex timmar, medel över 5 min.

source: Graphs on one day, average on 5mn.
sv: Graf över en dag, medel över 5 min.

source: Graphs on three days, average on 30mn.
sv: Graf över tre dagar, medel över 30 min.

source: Graphs on one week, average on 30mn.
sv: Graf över en vecka, medel över 30 min.

source: Graphs on one month, average on 2h
sv: Graf över en månad, medel över 2 timmar.

source: Graphs on six months, average on 1d.
sv: Graf över sex månader, medel över 1 dygn.

source: Graphs on one year, average on 1d
sv: Graf över ett år, medel över 1 dygn.

source: Maximum number of incoming e-mails
sv: Maximala antalet inkommande e-postmeddelanden

source: Maximum number of outgoing e-mails
sv: Maximalt antalet utgående e-postmeddelanden

source: Maximum % of hard disk usage
sv: Maximalt % utnyttjande av hårddisk

source: Maximum % of cpu usage
sv: Maximalt % utnyttjande av cpu

source: Maximum temperature for cpu and motherboard
sv: Maximal temperatur på cpu och moderkort

source: Maximum hard disk temperature
sv: Maximal temperatur på hårddisk

source: Maximum number of samba sessions
sv: Maximala antalet samba-sessioner

source: Maximum number of ssh sessions
sv: Maximala antalet ssh-sessioner

source: Maximum number of ftp sessions
sv: Maximala antalet ftp-sessioner

source: Maximum number of vpn sessions
sv: Maximala antalet vpn-sessioner

source: View graphs on :
sv: Visa grafer över:

source: server's hardware (sensors)
sv: serverns hårdvara (sensorer)

source: network use (connections,sessions,load)
sv: nätverksanvändning (anslutningar, sessioner, belastning)

source: system performance (cpu, memory, hard disk)
sv: systemprestanda (cpu, minne, hårddisk)

source: Advanced connection tests on services
sv: Avancerade anslutningstester på tjänster

source: Configuration of sme9admin
sv: Konfiguration av sme9admin

source: Active tcp connections tcp with external(blue)/local(green) connections highlighted :
sv: Aktiva tcp-anslutningar, tcp med externa(blå)/lokala(grön) anslutningar markerade:

source: Local IP:port
sv: Lokal IP:port

source: Remote IP:port
sv: Fjärr IP:port

source: State
sv: Tillstånd

source: Stats :
sv: Status :

source: Connected users :
sv: Ansluta användare :

source: Command
sv: Kommando

source: From
sv: Från

source: Idle
sv: Sysslolös

source: Login
sv: Logga in

source: Since
sv: Sedan

source: Web services
sv: Webbtjänster

source: Administrative services
sv: Administrativa tjänster

source: Network services
sv: Nätverkstjänster

source: File-sharing services
sv: Fildelningstjänster

source: E-mail services
sv: E-posttjänster

source: DNS services
sv: DNS-tjänster

source: Authentication services
sv: Autenticeringstjänster

source: Misc. services
sv: Övriga tjänster

source: System services
sv: Systemtjänster

source: System services (Click on a service name for details) :
sv: Systemtjänster (klicka på namnet för detaljer) :

source: Action
sv: Verkställ

source: Service
sv: Tjänst

source: Stopped
sv: Stoppad

source: Started
sv: Startad

source: Listening tcp sockets, and corresponding process :
sv: Lystnande tcp sockets och tillhörande processer :

source: Last update of ClamAV antivirus : %s.
sv: Senaste uppdatering av ClamAV antivirus : %s.

source: Warning ! Your antivirus may not be up-to-date.
sv: Varning! Ditt antirusprogram är förmodligen ej uppdaterat.

source: The database contains %s virus signatures.
sv: Databasen innehåller %s virussignaturer.

source: Some feature request, comment or bug report ? send an e-mail to
sv: Något önskemål, kommentar eller buggrapport? Skicka ett e-postmeddelande till

source: Configuration of status e-mails.
sv: Konfiguration av e-postmeddelanden angående status.

source: If you set the frequency to 0, status e-mails are disabled. You can put only the username if the recipient is a local user.
sv: Om du anger frekvensen till 0 så är statusmeddelanden avaktiverade. Du kan ange endast användarnamn om mottagaren är en lokal användare.

source: Status e-mails recipient
sv: Mottagare av statusmeddelanden

source: Frequency of status e-mails (* 5min)
sv: Frekvens på statusmeddelanden (* 5 min)

source: Configuration of MySQL connection.
sv: Konfigurationen av MySQL-anslutningen.

source: You shall only modify these settings if you change the default values with phpMyAdmin or mysqladmin. These settings don't directly affect the configuration of MySQL.
sv: Du skall endast modifiera dessa inställningar om du ändrat på de förvalda inställningarna med phpMyAdmin eller mysqladmin. Dessa inställningar påverkar inte direkt konfigurationen av MySQL.

source: Database
sv: Databas

source: MySQL user
sv: MySQL-användare

source: Password
sv: Lösenord

source: Configuration of network settings.
sv: Konfigurering av nätverksinställningar.

source: You can specify the names of the network interfaces to monitor, the e-mail domains and adresses to count in the e-mail graph (list of domains or adresses separated by semicolons. "me@domain.fr ; other-domain.com ; virtual.domain.fr" - the primary domain name and virtual domains are already counted). You can already choose a target for the ping latency graph (www.google.fr, default gateway,...)
sv: Du kan ange namnet på de nätverksinterface som du vill övervaka, e-postdomänern eller adresser för beräkning till e-postgrafen (lista över domäner eller adresser separeras med semikolon. "me@domain.fr ; other-domain.com ; virtual.domain.fr" - det primära domännamnet och det virtuella domännamnet är redan inräknat) Du kan redan nu välja ett mål för pingeftersläpningsgrafen (www.google.se, förvald gateway,...)

source: Other e-mail domains
sv: Andra e-postdomäner

source: Ping target
sv: Pingmål

source: Web panel configuration.
sv: Konfiguration av webbpanel.

source: You can set the format and size of graphs, and the bounds upon which pppoe and vpn connections need to be highlighted.
sv: Du kan ange formatet och storleken på graferna och de gränser som pppoe och vpn-anslutningarna skall markeras vid.

source: Graphs width
sv: Bredden på graferna

source: Graphs height
sv: Höjden på graferna

source: Pppoe disconnection lasting more than (in minutes)
sv: Pppoe-avbrott som varar längre än (i minuter)

source: Pppoe connection lasting less than (in hours)
sv: Pppoe-anslutningar som varar mindre än (i timmar)

source: Vpn connection lasting more than (in hours)
sv: Vpn-anslutning som varar mer än (i timmar)

source: Configuration of hardware sensors.
sv: Konfiguration av hårdvarusensorer.

source: For the hard disks, generally you have 'hda' or 'hdb' with IDE and 'sda' or 'sdb' with SATA/SCSI. If you have only on disk, let the second field blank. You can choose to activate the computing of the main directories' size of SME. (maybe long and resource-consuming on large disks). To find available sensors, execute 'sensors' in a shell, and look for the keywords corresponding to the working sensors ('temp1','CPU Temp','MB Temp','fan3',....). Let the fields blank if you have no sensors available.
sv: Avseende hårddiskarna så har du vanligtvis en 'hda' eller 'hdb' med IDE och 'sda' eller 'sdb' med SATA/SCSI. Om du endast har en disk, lämna det andra fältet tomt. Du kan välja att aktivera beräkningen av huvudmapparnas storlek på SME. (kan ta lång tid och kraft för stora diskar). För att hitta tillgängliga sensorer, exekvera 'sensors' i ett skal och leta efter nyckelord som korresponderar mot fungernade sensorer ('temp1','CPU Temp','MB Temp','fan3',....) Lämna fältet tomt om du inte har några tillgängliga sensorer.

source: Activate du -s:
sv: Aktivera du -s:

source: First hard disk
sv: Första hårddisken

source: Second hard disk
sv: Andra hårddisken

source: First sensor (cpu)
sv: Första sensorn (cpu)

source: Second sensor (motherboard)
sv: Andra sensorn (moderkort)

source: Third sensor (fan)
sv: Tredje sensorn (fläkt)

source: Configuration of alerts.
sv: Konfigurering av larm.

source: You should notice that these values are not limits FOR the system, but just values beyond which an alert e-mail is sent. If you set the limit to 0, the alert is disabled. You can put only the username if the recipient is a local user.
sv: Du bör vara medveten om att dessa värden inte är gränser för systemet, utan endast värden som om de överskrids gör att ett e-postmeddelande med en varning kommer att skickas. Om du sätter gränsen till 0 kommer inga varningar att skickas. Du kan ange endast ett användarnamn om mottagaren är en lokal användare.

source: Alert e-mails recipient
sv: Mottagare för e-postmeddelanden

source: Save
sv: Spara

source: Alert configuration.
sv: Konfigurering av varningar.

source: Put 0 to desactivate it.
sv: Ange 0 för avaktivering.

source: "%s" is not a valid e-mail address.
sv: "%s" är inte en giltig e-postadress.

source: "%s" is not an integer numeric value for the setting '%s'.
sv: "%s" är inte ett heltal som krävs för denna inställning '%s'.

source: Status e-mails have been disabled.
sv: E-postmeddelanden med status av avaktiverat.

source: New settings have been saved.
sv: De nya inställningarna har sparats

source: The settings are the same, nothing has been modified.
sv: Inställningarna är inte ändrade.

source: An error occured. Check the settings you provided.
sv: Ett fel uppstod. Kontrollera de värden du angivit.

source: Back
sv: Tillbaka

source: These differents tests may produce false positives, do not take care of them.
sv: De olika testerna kan producera ett falskt resultat, ta inte hand om dem.

source: Execute them only if you know what they do, and how to analyse their results.
sv: Exekvera dem endast om du vet vad de innebär och hur du skall analysera deras resultat.

source: Test http service
sv: Testa http service

source: Test samba service
sv: Testa samba service

source: Test network latency
sv: Testa näverkets eftersläpning

source: Test ftp service
sv: Testa ftp-service

source: Test ssh service
sv: Testa ssh-service

source: Test pop service
sv: Testa pop-service

source: Test smtp service
sv: Testa smtp-service

source: Execution of 'http@' (should return html source code of server's homepage):
sv: Exekvering av 'http@' (bör returnera html källkoden av serverns hemsida):

source: Execution of 'smbcontrol smbd ping' (samba server answers giving its PID):
sv: Exekvering av 'smbcontrol smbd ping' (sambaservern svarar genom att ange dess PID):

source: Execution of 'ping google.fr -c 1' (latency):
sv: Exekvering av 'ping google.fr -c 1' (eftersläpning):

source: Execution of 'echo "SYST" | nc %s 21' (ftp opened to the external network):
sv: Exekvering av 'echo "SYST" | nc %s 21' (ftp öppna till det externa nätverket):

source: Execution of 'echo "hello" | nc %s 22' (ssh opened to the external network):
sv: Exekvering av 'echo "hello" | nc %s 22' (ssh öppna till det externa nätverket):

source: Execution of 'echo "quit" | nc %s 110' (pop server running):
sv: Exekvering av 'echo "quit" | nc %s 110' (pop-server körs):

source: Execution of 'echo "quit" | nc -i 2 %s 25' (smtp server running):
sv: Exekvering av 'echo "quit" | nc -i 2 %s 25' (smtp-server körs):

source: Another test
sv: Ett test till

source: Check MySQL connection settings.
sv: Kontrollera inställningarna för MySQL.

source: one hour
sv: en timme

source: six hours
sv: sex timmar

source: the day
sv: idag

source: three days
sv: tre dagar

source: one week
sv: en vecka

source: one month
sv: en månad

source: six months
sv: sex månader

source: one year
sv: ett år

source: System load for the apache web server (httpd-e-smith & httpd-admin processes) on
sv: Systembelastningen för apache web server (httpd-e-smith & httpd-admin processerna) på

source: System load for the transparent http/ftp proxy squid on
sv: Systembelastningen för den transparanta http/ftp proxy squid på

source: IP Address
sv: IP-adress

source: Hostname
sv: Värdnamn

source: Start
sv: Första

source: End
sv: Sista

source: Detailed list of the last times a host has connected to a samba share.
sv: Detaljerad lista över de senaste gångerna en värd har anslutit till en samba share.

source: System load for the samba server (smbd & nmbd processes) on
sv: Systembelastningen för samba-servern (smbd & nmbd processes) på

source: Written data (Ko)
sv: Skriven data (Ko)

source: Read data (Ko)
sv: Läst data (Ko)

source: Detailed list of the last connections (on the last 7 days) to the afp service (Apple File Protocol).
sv: Detailjerad lista över de senaste anslutningarna (under de senaste 7 dagarna) till afp-servicen (Apple File Protocol).

source: System load for the appletalk server (atalkd, papd, afpd and cnid_metad processes).
sv: Systembelastning för appletalk server (atalkd, papd, afpd och cnid_metad processerna).

source: Duration
sv: Varaktighet

source: Client IP address
sv: Klientens IP-adress

source: Client local IP address
sv: Klientens lokala IP-adress

source: Incoming data (Ko)
sv: Inkommande data (Ko)

source: Outgoing data (ko)
sv: Utgående data (Ko)

source: Detailed list of vpn connections (Virtual Private Network).
sv: Detaljerad lista över vpn-anslutningar (Virtual Private Network).

source: MAC Address
sv: MAC-adress

source: Date of renewal
sv: Datum för förnyelse

source: List of the last dhcp leases renewal (Dynamic Host Control Protocol).
sv: Lista över de senaste dhcp förnyelserna (Dynamic Host Control Protocol).

source: Connection peer
sv: Anslutning peer

source: Detailed list of ADSL/PPPoE connections.
sv: Detaljerad lista över ADSL/PPPoE anslutningarna.

source: Connected ?
sv: Ansluten?

source: No
sv: Nej

source: Yes
sv: Ja

source: Detailed list of ssh connections (Secure SHell).
sv: Detaljerad lista över ssh-anslutningar (Secure SHell, säkert skal).

source: Detailed list of the last connections (on the last 7 days) to the ftp service (File Transfer Protocol).
sv: Detaljerad lista över de senaste anslutningarna (de senaste 7 dagarna) till ftp-tjänsten (File Transfer Protocol, filöverföringsprotokoll).

source: See the records on
sv: Se posterna för

source: MySQL error : Impossible to prepare SQL query "%s" : %s
sv: MySQL-fel: Omöjligt att förbereda SQL-frågan "%s" : %s

source: MySQL error : Can't execute query : %s
sv: MySQL-fel: Kan inte köra frågan : %s

source: Connections which lasted
sv: Anslutningar som varade

source: more than %s hours are highlighted.
sv: Mer än %s timmar är markerade.

source: less than %s hours are highlighted.
sv: mindre än %s timmar är markerade.

source: Disconnections which lasted
sv: Avbrutna förbindelser som varade

source: more than %s minutes are highlighted.
sv: mer än %s minuter är markerade.

source: root connections are highlighted.
sv: root-anslutningar är markerade.

source: Successful
sv: Genomfört

source: Disconnection lasted more than %s minutes
sv: Avbrutna förbindelser som varade mer än %s minuter

source: Error at RRDs::graph(%s) : %s
sv: Fel vid RRDs::graph(%s) : %s

source: View graphs on
sv: Visa grafer över

source: Temperatures
sv: Temperaturer

source: Hardware temperatures (Processor, motherboard, hard disks).
sv: Hårdvarutemperaturer (Processor, moderkort, hårddiskar).

source: Processor fan speed.
sv: Processorfläktens hastighet

source: Fan speed
sv: Fläkthastighet

source: Number of opened tcp connections for ssh, ftp, vpn, afp and netbios protocols.
sv: Antal öppna tcp-anslutningar för ssh, vpn, apf och netbios protokollen.

source: Opened connections
sv: Öppna anslutningar

source: Number of dhcp leases renewals and opened samba shares.
sv: Antalet fönyade dhcp-lån och öppna sambadelningar

source: Dhcp & Smbstatus
sv: Status för dhcp & Smbstatus

source: Number of incoming/outgoing e-mails and amount of spam/viruses filtered.
sv: Antal inkommande och utgående e-postmeddelanden och mängd spam/virus som är filtrerad.

source: Incoming/outgoing/spam/virus e-mails
sv: Inkommande/utgående/spam/virus e-postmeddelanden

source: Incoming mail
sv: Inkommande e-postmeddelanden

source: Outgoing mail
sv: Utgående e-postmeddeladen

source: Average and maximal ping with the selected target.
sv: Medeltal och maximalt ping för valt mål.

source: Target ping latency
sv: Mål för mätning av eftersläpning på ping

source: Avg ping
sv: Medel ping

source: Pkt loss
sv: Paketförlust

source: Load on the local network interface.
sv: Belastning på det lokala nätverkskortet.

source: Local network load
sv: Belastning på det lokala nätverket

source: Incoming bytes
sv: Inkommande bytes

source: Outgoing bytes
sv: Utgående bytes

source: Load on the external network interface (to internet).
sv: Belastning på det externa nätverkskortet (till Internet)

source: External network load
sv: Belastning på det externa nätverket

source: Network load on the server except routing.
sv: Belastning på nätverket förutom routning

source: If the blue curve is :
sv: Om den blå kurvan är :

source: positive => download from the internet
sv: positiv => nerladdning från Internet

source: negative => upload from the local network
sv: negativ => uppladdning från det lokala nätverket

source: If the red curve is :
sv: Om den röda kurvan är :

source: positive => upload from the internet
sv: positiv => uppladdning från Internet

source: negative => download from the local network
sv: negativ => nerladdning från det lokala nätverket

source: Network load on the server
sv: Nätverksbelastning på servern

source: Distribution of cpu usage for system, user and niced processes.
sv: Fördelning av cpu-användning för system, användare och nätverksprocesser.

source: Cpu usage
sv: Cpu-användning

source: System load average on 1mn,5mn,15mn compared to cpu usage.
sv: Systembelastning i medeltal för 1 min, 5 min, 15 min jämfört med cpu-användning

source: System load / Cpu %
sv: Systembelastning / Cpu %

source: Number of running processes on the server, and kernel run queue size.
sv: Antal processer på servern och kärnan körning köstorlek

source: Number of processes / run queue size
sv: Antal processer / körning köstorlek

source: Processes
sv: Processer

source: Run queue
sv: Körningskö

source: Server uptime.
sv: Serverns körtid

source: Uptime
sv: Körtid

source: Days
sv: Dagar

source: Detailed usage of the server memory.
sv: Detaljerad användning av minnet

source: Memory usage
sv: Minnesanvändning

source: Buffers
sv: Buffrar

source: Cached
sv: Cachad

source: Used
sv: Använd

source: Free
sv: Fritt

source: Total
sv: Totalt

source: Swap usage (virtual memory) on the server's hard disk.
sv: Växlingsutrymme (virtuellt minne) på serverns hårddisk.

source: Swap usage
sv: Användning av växlingsutrymme

source: Amount of raw data read/written on the hard disk.
sv: Storlek på rådata som är läst/skriven till hårddisken

source: Blocks/s
sv: Block

source: Read
sv: Lästa

source: Written
sv: Skrivna

source: Hard disk usage
sv: Hårddiskanvändning

source: Detailed usage of disk space (squid cache, mysql databases, log files, user files..).
sv: Detaljerad användning av hårddiskutrymme (squid cache, mysql databaser, loggfiler, användarfiler..).

source: Disk space usage.
sv: Användning av hårddiskutrymme.

source: Error at RRDs::update
sv: Fel vid RRDs::uppdatering

source: Number of opened connections :
sv: Antal öppna anslutningar :

source: During the last 5 minutes, %s incoming e-mails were detected,
sv: Under de senaste 5 minuterna upptäcktes %s inkommande e-postmeddelanden

source: you had set the alert limit to %s incoming e-mails.
sv: du har angivit larmgränsen till %s inkommande e-postmeddelanden.

source: (Possible reasons : do you receive spam ? a mailbomb ? mailing-lists ?)
sv: (Möjliga orsaker : Har du erhållit spam ? En e-postbombning? Mailinglistor ?)

source: If you have access to the server-manager, use this link to modify the limit :
sv: Om du har åtkomst till serverhanteraren, använd denna länk för att ändra gränden:

source: During the last 5 minutes, %s outgoing e-mails were detected,
sv: Under de senaste 5 minuterna har %s utgående e-postmeddelanden upptäckts,

source: you had set the alert limit to %s outgoing e-mails.
sv: du har angivit larmgränsen till %s utgående e-postmeddeladen

source: (Possible reasons : do you send spam ? administrate a mailing-list ?)
sv: (Möjliga orsaker : Har du skickat spam ? Administrerat en e-postlista?)

source: Your hard disk is %s %% full,
sv: Din hårddisk är %s %% full,

source: you had set the alert limit to %s %%.
sv: du har angivit larmgränsen till %s %%.

source: (Advice : free space by deleting temp files, or upgrade your disk space)
sv: (Förslag : Frigör utrymme genom att radera temporära filer eller öka ditt hårddiskutrymme)

source: Your processor is %s %% loaded,
sv: Din processor har %s %% belastning,

source: (Possible reasons : Is there a crashed process ? an intense and prolonged activity on the server ?)
sv: (Möjliga orsaker : Finns det en kraschad process ? En intensiv och förlängd aktivitet på servern ?)

source: The temperature reported by sensor %s is %s degrees C,
sv: Temperaturen som rapporterats av sensorn %s är %s grader C,

source: you had set the alert limit to %s degrees C.
sv: du har angivit larmgränsen till %s grader C.

source: (Advice : check the fans, and if the room is well ventilated or under AC.)
sv: (Förslag : Kontrollera fläktarna, om rummet är ventilerat eller har fungerande AC)

source: The temperature of %s hard disk is %s degrees C,
sv: Temperaturen på %s hårddisk är %s grader C,

source: (Advice : check if the server case and the hard disks are well cooled.)
sv: (Förslag : Kontrolera om serverns chassi eller hårddiskarna har tillräcklig kylning.)

source: There are %s opened connections to the SAMBA service,
sv: Det finns %s öppna anslutningar till SAMBA-tjänsten,

source: you had set the alert limit to %s connections.
sv: Du har angivit larmgränsen till %s anslutningar.

source: (Advice : if you encounter problems accessing local neighboorhood, kill some connections.)
sv: (Förslag : Om du upplever problem med åtkomsten till den lokala lagringsytan, avsluta några anslutningar.)

source: There are %s opened SSH sessions on the server,
sv: Det finns %s öppna SSH-sessioner på servern,

source: you had set the alert limit to %s sessions.
sv: Du har angivit larmgränsen till %s anslutningar.

source: (Advice : check if it is known administrative connections, and not hackers.)
sv: (Förslag : Kontrollera så att det är kända administrativa anslutningar och inte hackare.)

source: There are %s opened FTP sessions on the server,
sv: Det finns %s öppna FTP-sessioner på servern,

source: (Advice : check that it is authorized users only.)
sv: (Förslag : Kontrollera så att det endast är tillåtna användare.)

source: There are %s opened VPN sessions on the server,
sv: Det finns %s öppna VPN-sessioner på servern,
